{
  "backend/main.mo": "Entry point for the Motoko backend actor that composes blob storage functionality via the MixinStorage mixin.",
  "feature_evidence.json": "Feature evidence report mapping two hero section improvements—strengthened overlay contrast and removal of the animated scroll indicator—to their implementing file and test IDs.",
  "frontend-file-summaries.txt": "JSON document providing one-line summaries of each frontend source file for build planning reference.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Alexander Green – Worlds Hub' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that assembles the full landing page by rendering Header, HeroSection, WorldsSection, AboutSection, and Footer in sequence.",
  "frontend/src/components/AboutSection.tsx": "Two-column about section displaying the author portrait with decorative frames and a personal bio introducing Alexander Green's four fantasy worlds.",
  "frontend/src/components/Footer.tsx": "Dark-themed footer with author branding, smooth-scroll world and page navigation links, copyright, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with the author logo, desktop anchor links, scroll-aware background styling, and a collapsible mobile hamburger menu.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a strong dark gradient overlay and side vignette for text legibility, drop-shadowed copy, CTA buttons, and a static (non-animated) scroll indicator.",
  "frontend/src/components/WorldsSection.tsx": "Defines and renders a 'Worlds Showcase' section with four fantasy world cards (Mythica, The Scar Queen, The Chitin Realms, Skyline), each displaying an image, badge, title, tagline, description, and an external link button.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and helper flags to child components.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Cinzel, Crimson Text, Inter), sets up Tailwind base/components/utilities, and defines a dark fantasy OKLCH color palette via CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and InternetIdentityProvider wrappers around the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom fantasy design tokens (gold, crimson, ink, parchment colors), serif/display font families, OKLCH-based semantic color variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the landing page for author Alexander Green, tracking existing features, known issues (hero contrast and animation), architectural notes, and versioning for the build planner."
}