{
  "kind": "build_request",
  "title": "Fix hero text readability and remove distracting scroll animation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Improve text readability in the hero section by strengthening the overlay/contrast behind all headline and body text elements. Increase the darkness/opacity of the background overlay so that the hero image does not bleed through and reduce text legibility. Ensure the heading, subheading, and paragraph text all meet strong contrast ratios against the hero background image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the text on top of the hero image at the top is hard to read"
        ]
      },
      "acceptanceCriteria": [
        "All text in the hero section (name headline, bio paragraph, CTA button labels) is clearly legible against the background image",
        "The hero background overlay is sufficiently dark/opaque to ensure high contrast for all text",
        "The hero image is still visible but does not compete with text readability"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Remove the jumping/animated scrolling text element from the hero section. Any animated text that bounces, jumps, or loops as a scroll indicator or decorative element should be removed or replaced with a static, non-animated alternative if a scroll cue is still desired.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "the jumping scroll text is distracting"
        ]
      },
      "acceptanceCriteria": [
        "No text in the hero section has a jumping, bouncing, or looping animation",
        "The hero section feels calm and readable without distracting motion",
        "If a scroll-down cue remains, it is subtle and non-animated (or uses a gentle single fade rather than a repeating jump)"
      ]
    }
  ],
  "constraints": [
    "Do not alter the hero background image itself",
    "Do not change the content or copy of the hero section",
    "Do not modify any immutable frontend paths"
  ],
  "nonGoals": [
    "Redesigning the overall hero section layout",
    "Changing the hero section copy or structure",
    "Modifying any other section of the page"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}