{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix hero text readability and remove distracting scroll animation",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Improve text readability in the hero section by strengthening the overlay/contrast behind all headline and body text elements",
      "acceptanceCriteria": [
        "All text in the hero section (name headline, bio paragraph, CTA button labels) is clearly legible against the background image",
        "The hero background overlay is sufficiently dark/opaque to ensure high contrast for all text",
        "The hero image is still visible but does not compete with text readability"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Increase the opacity/darkness of the background overlay behind the hero text to ensure strong contrast. Adjust the overlay gradient or solid overlay layer so that all text elements (tagline, description, CTA buttons) meet high contrast ratios against the hero background image at frontend/public/assets/generated/hero-banner.dim_1600x800.png. Ensure the image remains visible but does not interfere with text legibility."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Remove the jumping/animated scrolling text element from the hero section",
      "acceptanceCriteria": [
        "No text in the hero section has a jumping, bouncing, or looping animation",
        "The hero section feels calm and readable without distracting motion",
        "If a scroll-down cue remains, it is subtle and non-animated (or uses a gentle single fade rather than a repeating jump)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Remove any animated text elements that bounce, jump, or loop (such as scroll indicators or decorative text). If a scroll-down cue is needed, replace it with a static or gently fading non-animated alternative. Ensure no repeating animations remain in the hero section."
        }
      ]
    }
  ]
}